tests/integration/PaymentGatewayApi/fixtures/getTransactionsResponse.json

{
  "invoices": [
      {
        "state":"waiting",
        "status":"Waiting",
        "status_loc":"Waiting",
        "pos_id":"web",
        "invoice_currency":"EUR",
        "invoice_amount":"222.00",
        "currency":"BTC",
        "amount":"0.01069040",
        "amount_exchange":"0.01066165",
        "network_processing_fee":"0.00002875",
        "address":"btc-793772d7f5a4463ea9737bb2d5c35204",
        "type":"Sell",
        "type_loc":"Sell",
        "payment":null,
        "refund":"",
        "refund_amount_opened":"",
        "refund_status":null,
        "refund_status_loc":null,
        "invoice_date":null,
        "inserted":"2023-02-08 15:15:07",
        "confirmed":null,
        "cancelled":null,
        "double_spending_alert":null,
        "accept_zero_confirmations":false,
        "item_name":null,
        "access_token":"HV0Lzn2I5gZ0_q6lssWgfErJAUS9vum5TzgD1qlNs32NThmnE5Uh4QEzTghmHTp_",
        "sid":null,
        "payment_id":"8b6231f0-d9ff-4ee3-acd5-ccd6a25ead44"
      },
      {
        "state":"waiting",
        "status":"Waiting",
        "status_loc":"Waiting",
        "pos_id":"web",
        "invoice_currency":"EUR",
        "invoice_amount":"222.00",
        "currency":"BTC",
        "amount":"0.01069040",
        "amount_exchange":"0.01066165",
        "network_processing_fee":"0.00002875",
        "address":"btc-10468a3d844846edb027b6f2c096c6e3",
        "type":"Sell",
        "type_loc":"Sell",
        "payment":null,
        "refund":"",
        "refund_amount_opened":"",
        "refund_status":null,
        "refund_status_loc":null,
        "invoice_date":null,
        "inserted":"2023-02-08 15:13:45",
        "confirmed":null,
        "cancelled":null,
        "double_spending_alert":null,
        "accept_zero_confirmations":false,
        "item_name":null,
        "access_token":"VfanF1RFzAmIywMOuYrfNn9aQqwNzkwPcnzmePH542LxZOvRqAOmTOBTKxulU16P",
        "sid":null,
        "payment_id":"810a90b2-e780-4396-8bb7-36b01c492021"
      }
  ]
}

